README.org
#+TITLE: CIS 4339 Debugging/Enhancement Exercise
#+LATEX_CLASS: article
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[letterpaper]{geometry}
#+LATEX_HEADER: \geometry{verbose,tmargin=0.8in,bmargin=0.6in,lmargin=0.75in,rmargin=0.75in}
#+LATEX_HEADER: \setlength{\parskip}{\medskipamount}
#+LATEX_HEADER: \setlength{\parindent}{0pt}
#+LATEX_HEADER: \usepackage{textcomp}
#+LATEX_HEADER: \usepackage{amssymb}
#+OPTIONS: ^:nil toc:nil

* Overview

The purpose of this class activity is to provide experience in correcting bugs and making enhancements to an existing application.

* Issues List

| Issue | Description                                                                                          |
|-------+------------------------------------------------------------------------------------------------------|
|     1 | Something broken: application cannot load - undefined local variable or method `task_path'           |
|     2 | The job class must have a location field to hold the street address where the job is to be performed |
|     3 | User interface for task needs way to pick job                                                        |
|     4 | There should be a field in the Task that allows it to be marked as completed                         |
|     5 | There should be a field in the Task where the number of hours worked can be entered                  |
|     6 | The word "Task" is misspelled on the New Task page!                                                  |
|     7 | The Task list should include the job that the task belongs to                                        |
|     8 | A job should be able to be marked as completed                                                       |
|     9 | The job list should have completed jobs listed separately from incomplete jobs                       |
|    10 | Jobs can be created with no name!                                                                    |
#+tblfm: $1=@#-1

* Turning in the assignment 
Turn in the ssh clone key to Blackboard. This is a graded assignment (not an automatic 100). Grading is based on how many of the issues you /correctly/ address.
